<a href="https://colab.research.google.com/github/Katherine-bq/Google/blob/master/python%E7%9F%A5%E8%AF%86%E7%82%B9%E5%A4%8D%E4%B9%A0%E4%B9%8Bpandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

对比 NumPy (np) 和 Pandas (pd) 每个维度下的数据结构，不难看出

    pd 多维数据表 = np 多维数组 + 描述

其中

Series = 1darray + index
DataFrame = 2darray + index + columns
Panel = 3darray + index + columns + item

#### 1.创建
- Series: 一维数据，类似于 python 中的基本数据的 list 或 NumPy 中的 1D array。Pandas 里最基本的数据结构

- DataFrame: 二维数据，类似于 R 中的 data.frame 或 Matlab 中的 Tables。DataFrame 是 Series 的容器

- Panel：三维数据。Panel 是 DataFrame 的容器

##### 1.1 Seris
创建 Series 只需用下面一行代码

    pd.Series( x, index=idx )
其中x 是位置参数，index 是默认参数，默认值为 idx=range(0, len(x))

其中 x 可以是

列表 (list)

numpy 数组 (ndarray)

字典 (dict)

In [0]:
s = pd.Series([27.2, 27.65, 27.70, 28])

In [0]:
#用日期当索引
dates = pd.date_range('20190401',periods=4)
s2 = pd.Series([27.2, 27.65, 27.70, 28],index=dates)
s2

2019-04-01    27.20
2019-04-02    27.65
2019-04-03    27.70
2019-04-04    28.00
Freq: D, dtype: float64

- 用字典创建series

创建 Series 还可以用字典。字典的「键值对」的「键」自动变成了 Series 的索引 (index)，而「值」自动变成了Series 的值 (values)。

In [0]:
dict = { 'BABA': 187.07, 'PDD': 21.83, 'JD': 30.79, 'BIDU': 184.77 }
s3 = pd.Series(dict,name='中概股')
s3.index.name = '股票代号'
s3

股票代号
BABA    187.07
PDD      21.83
JD       30.79
BIDU    184.77
Name: 中概股, dtype: float64

In [0]:
sdata = {'BABA':160,'PDD':28,'JD':25}
stock = ['FB', 'BABA', 'PDD', 'JD']
s4 = pd.Series( sdata, index=stock )
s4

FB        NaN
BABA    160.0
PDD      28.0
JD       25.0
dtype: float64

In [0]:
s3+s4

BABA    347.07
BIDU       NaN
FB         NaN
JD       55.79
PDD      49.83
dtype: float64

##### 1.2 Dataframe
创建 DataFrame 只需用下面一行代码

    pd.DataFrame( x, index=idx,columns=col )

其中 x 可以是

- 二维列表 (list)
- 二维 numpy 数组 (ndarray)
- 字典 (dict)，其值是一维列表、numpy 数组或 Series
- 另外一个 DataFrame

In [0]:
#用列表或numpy数组
df1 = pd.DataFrame( [[1, 2, 3], [4, 5, 6]] )
df2 = pd.DataFrame( np.array([[1, 2, 3], [4, 5, 6]]) )
print(df1)
print(df2)

   0  1  2
0  1  2  3
1  4  5  6
   0  1  2
0  1  2  3
1  4  5  6

In [0]:
#使用字典创建
symbol = ['BABA', 'JD', 'AAPL', 'MS', 'GS', 'WMT']
data = {'行业': ['电商', '电商', '科技', '金融', '金融', '零售'],
        '价格': [176.92, 25.95, 172.97, 41.79, 196.00, 99.55],
        '交易量': [16175610, 27113291, 18913154, 10132145, 2626634, 8086946],
        '雇员': [101550, 175336, 100000, 60348, 36600, 2200000]}
df3 = pd.DataFrame(data,index=symbol)
df3.index.name='代号'
df3

      行业      价格       交易量       雇员
代号
BABA  电商  176.92  16175610   101550
JD    电商   25.95  27113291   175336
AAPL  科技  172.97  18913154   100000
MS    金融   41.79  10132145    60348
GS    金融  196.00   2626634    36600
WMT   零售   99.55   8086946  2200000

In [0]:
df3.values

array([['电商', 176.92, 16175610, 101550],
       ['电商', 25.95, 27113291, 175336],
       ['科技', 172.97, 18913154, 100000],
       ['金融', 41.79, 10132145, 60348],
       ['金融', 196.0, 2626634, 36600],
       ['零售', 99.55, 8086946, 2200000]], dtype=object)

#### 2.合并和拼接
- 左连接 (left join)：合并之后显示 df1 的所有行
- 右连接 (right join)：合并之后显示 df2 的所有行
- 外连接 (outer join)：合并 df1 和 df2 共有的所有行
- 内连接 (inner join)：合并所有行 (默认情况)

#####合并

In [14]:
#多键合并，键合并用的语法和单键合并一样，只不过 on=c 中的 c 是多栏。

porfolio1 = pd.DataFrame({'Asset': ['FX', 'FX', 'IR'], 
                          'Instrument': ['Option', 'Swap', 'Option'], 
                          'Number': [1, 2, 3]})
porfolio2 = pd.DataFrame({'Asset': ['FX', 'FX', 'FX', 'IR'], 
                          'Instrument': ['Option', 'Option', 'Swap', 'Swap'], 
                          'Number': [4, 5, 6, 7]})
pd.merge(porfolio1,porfolio2,on=['Asset','Instrument'],how='outer',suffixes = ('1','2'))

  Asset Instrument  Number1  Number2
0    FX     Option      1.0      4.0
1    FX     Option      1.0      5.0
2    FX       Swap      2.0      6.0
3    IR     Option      3.0      NaN
4    IR       Swap      NaN      7.0

#####重塑和透视
重塑 (reshape) 和透视 (pivot) 两个操作只改变数据表的布局 (layout)：

重塑用 stack 和 unstack 函数 (互为逆转操作)

透视用 pivot 和 melt 函数 (互为逆转操作)

In [0]:
dates = pd.date_range('20190221',periods=3)
data = pd.DataFrame({'symbol':[153,234,45],
             'open':[54,65,12],
             'low':[24,54,12]})

data['date'] = dates

In [23]:
data

   symbol  open  low       date
0     153    54   24 2019-02-21
1     234    65   54 2019-02-22
2      45    12   12 2019-02-23

In [29]:
data.pivot(index='date',columns = 'symbol',values=['low','open'])

             low              open
symbol       45    153   234   45    153   234
date
2019-02-21   NaN  24.0   NaN   NaN  54.0   NaN
2019-02-22   NaN   NaN  54.0   NaN   NaN  65.0
2019-02-23  12.0   NaN   NaN  12.0   NaN   NaN

In [34]:
groupd = data.groupby('low')
groupd.size()

low
12    1
24    1
54    1
dtype: int64

In [33]:
for i in groupd:
  print(i)

(12,    symbol  open  low       date
2      45    12   12 2019-02-23)
(24,    symbol  open  low       date
0     153    54   24 2019-02-21)
(54,    symbol  open  low       date
1     234    65   54 2019-02-22)

In [35]:
#整合还可以用内置函数 aggregate() 或 agg() 作用到「组对象」上
groupd.agg(np.mean)

     symbol  open
low
12       45    12
24      153    54
54      234    65